---
kind: property
id: P:Autodesk.Revit.DB.ExternalResourceReference.Version
source: html/04796691-0778-07c2-9b90-ebabeabcb1dc.htm
---
# Autodesk.Revit.DB.ExternalResourceReference.Version Property

The version of the external data that was most recently loaded in Revit.

## Syntax (C#)
```csharp
public string Version { get; internal set; }
```